@ottes so, I've dig up a bit more... Turns out someone really messed up the documentation... 

What you want is 
```
data "kubectl_path_documents" "manifests-directory-yaml" {
  pattern = "./manifests/*.yaml"
}
resource "kubectl_manifest" "directory-yaml" {
  for_each  = data.kubectl_path_documents.manifests-directory-yaml.manifests
  yaml_body = each.value
}
```

and it will generate a nice plan 
```

  # kubectl_manifest.directory-yaml["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/name-here-crontabs.stable.example.com"] will be created
  + resource "kubectl_manifest" "directory-yaml" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "name-here-crontabs.stable.example.com"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: name-here-crontabs.stable.example.com
            spec:
              conversion:
                strategy: None
              group: stable.example.com
              names:
                kind: CronTab
                plural: name-here-crontabs
                shortNames:
                - ct
                singular: crontab
              scope: Namespaced
              version: v1
              versions:
              - name: v1
                served: true
                storage: true
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.directory-yaml["/apis/networking.k8s.io/v1/namespaces/xxx/ingresses/name-here"] will be created
  + resource "kubectl_manifest" "directory-yaml" {
      + api_version             = "networking.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Ingress"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "name-here"
      + namespace               = "xxx"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: networking.k8s.io/v1
            kind: Ingress
            metadata:
              annotations:
                azure/frontdoor: enabled
                azure/sensitive: this is a big secret
                nginx.ingress.kubernetes.io/rewrite-target: /
              name: name-here
              namespace: xxx
            spec:
              ingressClassName: nginx
              rules:
              - host: '*.example.com'
                http:
                  paths:
                  - backend:
                      service:
                        name: test
                        port:
                          number: 80
                    path: /testpath
                    pathType: Prefix
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.directory-yaml["/apis/stable.example.com/v1/crontabs/name-here-crd"] will be created
  + resource "kubectl_manifest" "directory-yaml" {
      + api_version             = "stable.example.com/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CronTab"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "name-here-crd"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: stable.example.com/v1
            kind: CronTab
            metadata:
              name: name-here-crd
            spec:
              cronSpec: '* * * * /5'
              image: my-awesome-cron-image
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.directory-yaml["/apis/stable.example.com/v1/crontabs/name-here-crd-single"] will be created
  + resource "kubectl_manifest" "directory-yaml" {
      + api_version             = "stable.example.com/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CronTab"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "name-here-crd-single"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: stable.example.com/v1
            kind: CronTab
            metadata:
              name: name-here-crd-single
            spec:
              cronSpec: '* * * * /5'
              image: my-awesome-cron-image
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

Notice how the key of the resource is a proper unique attribute?

I will update the documentation of the related data source